import { RichText } from './rich-text'

export const richTextData: RichText = [
  { type: 'p', children: [{ text: 'A line of text in a paragraph.' }] },
  {
    type: 'p',
    children: [
      { text: 'Bold ', b: true },
      { text: 'with italics ', b: true, i: true },
      { text: 'and underlined.', b: true, i: true, u: true },
    ],
  },
  {
    type: 'p',
    children: [
      { text: 'Italic and underlined', i: true, u: true },
      { text: ' italics only.', i: true },
    ],
  },
  {
    type: 'p',
    children: [
      { text: 'subscript' },
      { text: '1+3', sb: true },
      { text: ' superscript' },
      { text: '1+7', sp: true },
    ],
  },
  {
    type: 'p',
    children: [
      { text: 'bold superscript' },
      { text: '123456789 ⇒', b: true, sp: true },
      { text: ' strike through me', st: true },
      { text: ' underline me', u: true },
    ],
  },
  {
    type: 'p',
    children: [
      {
        text: 'If underlined and strike through, then only strike through should be rendered.',
        st: true,
        u: true,
      },
      { text: ' ' },
      { text: 'However if it is just underlined, then all should be fine.', u: true },
    ],
  },
]

export const richTextSuggestions: RichText[] = [
  [
    { type: 'p', children: [{ text: 'first line' }, { text: 'sup', sp: true }] },
    { type: 'p', children: [{ text: 'second line' }] },
  ],
  [
    {
      type: 'p',
      children: [
        {
          text: 'РЕГЛАМЕНТ (ЕО) № 2073/2005 НА КОМИСИЯТА от 15 ноември 2005 година относно микробиологични критерии за храните',
        },
      ],
    },
  ],
  [
    {
      type: 'p',
      children: [
        {
          text: 'Наредба № 1 от 26.012016г. за хигиената на храните, издадена от Министъра на здравеопазването и Министъра на земеделието, храните и горите, Обн. ДВ. бр.51 от 19 Юни 2018 г.',
        },
      ],
    },
  ],
  [
    {
      type: 'p',
      children: [
        {
          text: 'НАРЕДБА № 9 от 16.03.2001г. ЗА КАЧЕСТВОТО НА ВОДАТА, ПРЕДНАЗНАЧЕНА ЗА ПИТЕЙНО-БИТОВИ ЦЕЛИ, издадена от Mинистъра на здравеопазването, Mинистъра на регионалното развитие и благоустройството и Mинистъра на околната среда и водите, Обн. ДВ. бр.30 от 28 Март 2001г., с последно изм. и доп. ДВ. бр.6 от 16 Януари 2018г.',
        },
      ],
    },
  ],
  [
    {
      type: 'p',
      children: [
        {
          text: 'Наредба № 4 от 19.02.2008 г. за специфичните изисквания при производството, съхранението и транспортирането на сурово мляко и изискванията за търговия и пускане на пазара на мляко и млечни продукти, изм.ДВ. бр.23 от 22.03.2011 г.',
        },
      ],
    },
  ],
  [{ type: 'p', children: [{ text: 'Техническа документация на заявител' }] }],
  [{ type: 'p', children: [{ text: 'Не се установява в 25g (n1-n5)' }] }],
  [{ type: 'p', children: [{ text: 'Не се установява в 10g (n1-n5)' }] }],
  [{ type: 'p', children: [{ text: 'Не се установяват в 1g (n1-n5)' }] }],
  [{ type: 'p', children: [{ text: 'Не се установяват в 0,1g (n1-n5)' }] }],
  [{ type: 'p', children: [{ text: 'Не се открива' }] }],
  [{ type: 'p', children: [{ text: 'Не се установява' }] }],
  [{ type: 'p', children: [{ text: '<1' }] }],
  [{ type: 'p', children: [{ text: '<10' }] }],
  [{ type: 'p', children: [{ text: '<1x10' }, { text: '1', sp: true }, { text: ' (n1-n5)' }] }],
  [{ type: 'p', children: [{ text: '<1x10^2 (n1-n5)' }] }],
  [{ type: 'p', children: [{ text: '<1x10^3 (n1-n5)' }] }],
  [{ type: 'p', children: [{ text: '<1x10^4 (n1-n5)' }] }],
  [{ type: 'p', children: [{ text: '<1x10^5 (n1-n5)' }] }],
  [{ type: 'p', children: [{ text: '0/1' }] }],
  [{ type: 'p', children: [{ text: '0/100' }] }],
  [{ type: 'p', children: [{ text: '0/250' }] }],
  [
    {
      type: 'p',
      children: [
        { text: 'Не се установява бомбаж, хлопащи и вибриращи капаци и дъна и други дефекти' },
      ],
    },
  ],
  [{ type: 'p', children: [{ text: 'n2 = ' }] }],
  [{ type: 'p', children: [{ text: 'n1 =  ' }] }],
  [{ type: 'p', children: [{ text: 'n3 =' }] }],
  [{ type: 'p', children: [{ text: 'n4 = ' }] }],
  [{ type: 'p', children: [{ text: 'n5 =' }] }],
  [{ type: 'p', children: [{ text: 'Под LOD' }] }],
  [{ type: 'p', children: [{ text: 'Под LOQ' }] }],
  [{ type: 'p', children: [{ text: 'Специфичен за продукта' }] }],
  [{ type: 'p', children: [{ text: 'БДС 15:2010. Българско бяло саламурено сирене' }] }],
  [{ type: 'p', children: [{ text: 'БДС 12:2010. Българско кисело мляко' }] }],
  [
    {
      type: 'p',
      children: [
        {
          text: 'Пробата е съхранявана при температура 2-8°C и изпитването е проведено в края на срока на годност',
        },
      ],
    },
  ],
  [
    {
      type: 'p',
      children: [
        {
          text: 'Посочените норми са съгласно изискване на възложителя и са както дадените в Eur. Ph. 5.1.4',
        },
      ],
    },
  ],
  [
    {
      type: 'p',
      children: [
        {
          text: 'Регламент (ЕО) № 1441/2007 на Комисията от 5 декември 2007 година за изменение на Регламент (ЕО) № 2073/2005 относно микробиологичните критерии за храните (Текст от значение за ЕИП )',
        },
      ],
    },
  ],
  [
    {
      type: 'p',
      children: [
        {
          text: 'Регламент (ЕС) 2017/2158 на Комисията от 20 ноември 2017 година за установяване на мерки за смекчаване на последиците и референтни нива за намаляване на наличието на акриламид в хранителните продукти',
        },
      ],
    },
  ],
  [
    {
      type: 'p',
      children: [
        {
          text: 'НАРЕДБА ЗА ИЗИСКВАНИЯТА КЪМ БУТИЛИРАНИТЕ НАТУРАЛНИ МИНЕРАЛНИ, ИЗВОРНИ И ТРАПЕЗНИ ВОДИ, ПРЕДНАЗНАЧЕНИ ЗА ПИТЕЙНИ ЦЕЛИ, в сила от 03.08.2004 г., Приета с ПМС № 178 от 23.07.2004 г., Обн. ДВ. бр.68 от 3 Август 2004г., изм. ДВ. бр.22 от 15 Март 2005г., изм. ДВ. бр.54 от 4 Юли 2006г., изм. ДВ. бр.66 от 25 Юли 2008г.ли 2006г., изм. ДВ. бр.66 от 25 Юли 2008г.',
        },
      ],
    },
  ],
  [{ type: 'p', children: [{ text: 'European Pharmacopoeia' }] }],
  [
    {
      type: 'p',
      children: [
        {
          text: 'Директива 94/62/ЕС от 20 декември 1994 г. за опаковките и отпадъците от опаковки',
        },
      ],
    },
  ],
  [
    {
      type: 'p',
      children: [{ text: 'Под LOD - за олово(Pb), кадмий(Cd), хром(VI)Cr(VI) и живак (Hg)' }],
    },
  ],
  [
    {
      type: 'p',
      children: [
        {
          text: 'Инструкция №34 за хигиената на спортните обекти и екипировка, издадена от МИНИСТЕРСТВОТО НА НАРОДНОТО ЗДРАВЕ, Обн. ДВ. бр.82 от 24 Октомври 1975г., изм. ДВ. бр.18 от 2 Март 1984г., изм. ДВ. бр.25 от 8 Март 2002 г',
        },
      ],
    },
  ],
  [
    {
      type: 'p',
      children: [
        {
          text: 'РЕГЛАМЕНТ (ЕС) № 10/2011 НА КОМИСИЯТА  от 14 януари 2011 година  относно материалите и предметите от пластмаси, предназначени за контакт с храни  (текст от значение за ЕИП)',
        },
      ],
    },
  ],
  [
    {
      type: 'p',
      children: [
        { text: 'Допустимите стойности са посочени в Заявката за изпитване на заявителя' },
      ],
    },
  ],
  [
    {
      type: 'p',
      children: [
        {
          text: 'Регламент (ЕО) № 1881/2006 на Комисията от 19 декември 2006 година за определяне на максимално допустимите количества на някои замърсители в храните',
        },
      ],
    },
  ],
  [
    {
      type: 'p',
      children: [
        {
          text: 'Регламент (ЕС) № 601/2014 на Комисията от 4 юни 2014 година за изменение на приложение II към Регламент (ЕО) № 1333/2008 на Европейския парламент и на Съвета по отношение на категориите храни от месо и употребата на някои добавки в месните полуфабрикати',
        },
      ],
    },
  ],
  [{ type: 'p', children: [{ text: 'БДС EN 15073:2013' }] }],
  [
    {
      type: 'p',
      children: [
        {
          text: 'Началото на изпитването съвпада с края на срока на годност на продукта, съгласно изискванията на производителя',
        },
      ],
    },
  ],
  [
    {
      type: 'p',
      children: [
        {
          text: 'Наредба №2 от 23.02.2017 за специфичните изисквания за производство, събиране, транспортиране и преработка на сурово краве мляко, предлагането на пазара на мляко и млечни продукти и официалния им контрол, в сила от 07.03.2017, издаден от министъра на земеделието и храните, Обн.ДВ.бр.20 от 07.03.2017',
        },
      ],
    },
  ],
  [
    {
      type: 'p',
      children: [
        {
          text: 'НАРЕДБА №1 от 12.03.2018 г. за условията и реда за издаване на разрешение за отглеждане на растения от рода на конопа (канабис), предназначени за влакно, семена за фураж и храна и семена за посев, със съдържание под 0,2 тегловни процента на тетрахидроканабинол, определено в листната маса, цветните и плодните връхчета, за търговия и контрол',
        },
      ],
    },
  ],
  [{ type: 'p', children: [{ text: 'Съдържание в mg/110 g: ' }] }],
  [{ type: 'p', children: [{ text: 'Съдържание в g/110 g:' }] }],
  [{ type: 'p', children: [{ text: 'Не е зададена' }] }],
  [{ type: 'p', children: [{ text: 'Ph.Eur. 2.8.13' }] }],
  [{ type: 'p', children: [{ text: '< 0.01' }] }],
  [
    {
      type: 'p',
      children: [{ text: 'Под LOQ; Изчисленият резултат не е коригиран за влажността на пробата' }],
    },
  ],
  [{ type: 'p', children: [{ text: 'Категория III на БДС EN 71-3:2019' }] }],
  [
    {
      type: 'p',
      children: [
        {
          text: 'Наредба № 3 от 04.06.2007 г. за специфичните изисквания към материалите и предметите, различни от пластмаси, предназначени за контакт с храни',
        },
      ],
    },
  ],
  [
    {
      type: 'p',
      children: [
        {
          text: '1. Регламент (ЕС) № 10/2011 на Комисията от  14 януари 2011  година относно материалите и предметите от пластмаси, предназначени за контакт с храни;  2. Регламент (ЕС) 2018/831 на Комисията от 5 юни 2018 година за изменение на Регламент (ЕС) № 10/2011 относно материалите и предметите от пластмаси, предназначени за контакт с храни; 3. Наредба № 2 от 23.01.2008 за материалите и предметите от пластмаси, предназначени за контакт с храни',
        },
      ],
    },
  ],
  [{ type: 'p', children: [{ text: 'Не се открива в 1g ' }] }],
  [
    {
      type: 'p',
      children: [
        {
          text: 'Под LOQ (За Methyl tin, Butyl tin, Di-n-propyl tin, Dibutyl tin, Tributyl tin, n-Octyl tin, Tetrabutyl tin, Diphenyl tin, Di-n-octyl tin, Triphenyl tin)',
        },
      ],
    },
  ],
  [
    {
      type: 'p',
      children: [
        {
          text: 'Под LOD (За Methyl tin, Butyl tin, Di-n-propyl tin, Dibutyl tin, Tributyl tin, n-Octyl tin, Tetrabutyl tin, Diphenyl tin, Di-n-octyl tin, Triphenyl tin)',
        },
      ],
    },
  ],
  [
    {
      type: 'p',
      children: [{ text: 'Заповед № РД-01-249/03.05.2020 г. на Министъра на здравеопазването' }],
    },
  ],
  [
    {
      type: 'p',
      children: [
        {
          text: 'Посочените норми са съгласно изискване на възложителя и са както дадените в Eur. Ph. 5.1.8',
        },
      ],
    },
  ],
  [{ type: 'p', children: [{ text: 'Ph.Eur 5.1.4' }] }],
]
